# #전위순회

def DFS(v):
    if v>7:
        return
    else: #호출 넘어가기전에 본연의 일을 다 해놓고 넘어감: 전위순회! 자기껄 먼저하고 왼쪽오른쪽감!
        print(v, end = ' ')
        DFS(v*2)
        DFS(v*2+1)


if __name__ == "__main__":
    DFS(1) 

#------------------------------------------------------------------------------#

# #중위순회

def DFS(v): 
    if v>7:
        return
    else: #왼쪽 먼저 처리하고, 부모가 중간에서 처리되는거지! 중위순회
        DFS(v*2)
        print(v, end = ' ')
        DFS(v*2+1)

if __name__ == "__main__":
    DFS(1) 

#------------------------------------------------------------------------------#

#후위순회 : 대표적 병합정렬

def DFS(v):
    if v>7:
        return
    else: #왼쪽 먼저 처리하고, 오른쪽 다 처리하고 되돌아와서 내 할일 처리한다! 후위순회
        DFS(v*2)
        DFS(v*2+1)
        print(v, end = ' ')


if __name__ == "__main__":
    DFS(1) 